app/controllers/api/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    respond_with Item.all

INSERT INTO "items" ("name", "url", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "abc"], ["url", "abc.com"], ["price", 0.123e3], ["created_at", 2017-04-06 13:30:39 UTC], ["updated_at", 2017-04-06 13:30:39 UTC]]
---
  def create
    respond_with :api, Item.create(item_params)

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]
---
  def destroy
    respond_with Item.destroy(params[:id])

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "items" SET "url" = ?, "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["url", "6.5"], ["price", 0.65e1], ["updated_at", 2017-04-04 19:12:46 UTC], ["id", 7]]
---
  def update
    item = Item.find(params[:id])
    item.update_attributes(item_params)